УНФ_ТЕСТ/src/InformationRegisters/ОписаниеGTINИС/ОписаниеGTINИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписаниеGTINИС</name>
  <comment>Информация о стандартных упаковках маркируемой продукции</comment>
  <attributes>
    <name>ВидУпаковки</name>
    <type>
      <types>EnumRef.ВидыУпаковокИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Enums/ВидыУпаковокИС/ВидыУпаковокИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУпаковокИС</name>
  <enumValues>
    <name>Логистическая</name>
  </enumValues>
  <enumValues>
    <name>Групповая</name>
  </enumValues>
  <enumValues>
    <name>Потребительская</name>
  </enumValues>
  <enumValues>
    <name>Неопределен</name>
  </enumValues>
  <enumValues>
    <name>АкцизнаяМаркаСНомеромИСерией</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/CommonForms/УточнениеКоэффициентовУпаковокИСМП/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходящаяТаблицаОписаниеGTIN = ПолучитьИзВременногоХранилища(Параметры.АдресУточнениеКоэффициентовУпаковок);
	
	Если ТипЗнч(ВходящаяТаблицаОписаниеGTIN) = Тип("ТаблицаЗначений") Тогда
		
		ОписаниеGTIN.Загрузить(ВходящаяТаблицаОписаниеGTIN);
		
	ИначеЕсли ТипЗнч(ВходящаяТаблицаОписаниеGTIN) = Тип("Массив") Тогда
		
		Для Каждого СтрокаДанных Из ВходящаяТаблицаОписаниеGTIN Цикл
			НоваяСтрока = ОписаниеGTIN.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Отказ = Ложь;
	Для Каждого СтрокаТЧ Из ОписаниеGTIN Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Коэффициент) Тогда
			
			Индекс = ОписаниеGTIN.Индекс(СтрокаТЧ) + 1;
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не заполнено поле ""Количество вложенных потребительских упаковок""'"),,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОписаниеGTIN", Индекс, "Коэффициент"),,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = СохранитьДанные();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть("УточненыКоэффициентыУпаковокИСМП");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохранитьДанные()
	
	ИсточникДанных = ОписаниеGTIN.Выгрузить();
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОписаниеGTINИС");
		ЭлементБлокировки.ИсточникДанных = ИсточникДанных;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("GTIN", "GTIN");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Для Каждого СтрокаТЧ Из ИсточникДанных Цикл
			
			НаборЗаписей = РегистрыСведений.ОписаниеGTINИС.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.GTIN.Установить(СтрокаТЧ.GTIN, Истина);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.GTIN        = СтрокаТЧ.GTIN;
			Если ЗначениеЗаполнено(СтрокаТЧ.ВидУпаковки) Тогда
				ЗаписьНабора.ВидУпаковки = СтрокаТЧ.ВидУпаковки;
			ИначеЕсли СтрокаТЧ.Коэффициент > 1 Тогда
				ЗаписьНабора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая;
			Иначе
				ЗаписьНабора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
			КонецЕсли;
			ЗаписьНабора.Коэффициент = СтрокаТЧ.Коэффициент;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Ложь;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не удалось записать набор записей регистра сведений ОписаниеGTIN ИС по причине: %1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ГосИС: Запись коэффициентов вложенных потребительских упаковок'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ОписаниеGTINИС, Неопределено,
			ТекстСообщения);
		
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти
